{"config": [{"config": {"name": "masking_1", "trainable": true, "batch_input_shape": [null, 3, 14], "dtype": "float32", "mask_value": -1}, "class_name": "Masking"}, {"config": {"use_bias": true, "go_backwards": false, "kernel_constraint": null, "batch_input_shape": [null, 3, 14], "recurrent_regularizer": null, "unit_forget_bias": true, "implementation": 1, "recurrent_dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_sequences": false, "trainable": true, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "activation": "tanh", "units": 32, "unroll": false, "bias_regularizer": null, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "activity_regularizer": null, "recurrent_constraint": null, "name": "lstm_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "dtype": "float32"}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "units": 7, "batch_input_shape": [null, 32], "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}