{"config": [{"config": {"trainable": true, "mask_value": -1, "name": "masking_1", "batch_input_shape": [null, 3, 11], "dtype": "float32"}, "class_name": "Masking"}, {"config": {"recurrent_regularizer": null, "recurrent_constraint": null, "activation": "tanh", "batch_input_shape": [null, 3, 11], "return_state": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "return_sequences": false, "bias_constraint": null, "dtype": "float32", "recurrent_dropout": 0.0, "dropout": 0.0, "go_backwards": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "name": "lstm_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "stateful": false, "kernel_regularizer": null, "use_bias": true, "implementation": 1}, "class_name": "LSTM"}, {"config": {"activation": "linear", "name": "dense_1", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32], "kernel_constraint": null, "dtype": "float32", "units": 6, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow"}