{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"trainable": true, "dtype": "float32", "name": "masking_1", "mask_value": -1, "batch_input_shape": [null, 3, 11]}}, {"class_name": "LSTM", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "name": "lstm_1", "unit_forget_bias": true, "dropout": 0.0, "recurrent_activation": "hard_sigmoid", "units": 32, "go_backwards": false, "batch_input_shape": [null, 3, 11], "implementation": 1, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "recurrent_dropout": 0.0, "return_state": false, "activity_regularizer": null, "kernel_constraint": null, "stateful": false, "trainable": true, "activation": "tanh", "bias_constraint": null, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_constraint": null, "kernel_regularizer": null, "recurrent_regularizer": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "units": 6, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "dtype": "float32", "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "batch_input_shape": [null, 32], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}]}